[
  {
    "Id": 1,
    "employeeId": 1,
    "reviewPeriod": "Q3 2024",
    "reviewDate": "2024-09-30",
    "overallRating": 4,
    "technicalSkills": 4,
    "communication": 5,
    "leadership": 3,
    "teamwork": 4,
    "problemSolving": 4,
    "goals": "Complete the new user authentication system, mentor junior developers, improve code review process",
    "achievements": "Successfully delivered authentication system 2 weeks ahead of schedule, mentored 2 junior developers, reduced code review time by 30%",
    "areasForImprovement": "Take more initiative in cross-functional projects, improve presentation skills for technical demos",
    "feedback": "Excellent performance this quarter. Shows strong technical skills and great collaboration with the team. Areas for improvement include taking more initiative in cross-functional projects.",
    "reviewerName": "Emily Davis"
  },
  {
    "Id": 2,
    "employeeId": 1,
    "reviewPeriod": "Q2 2024",
    "reviewDate": "2024-06-30",
    "overallRating": 4,
    "technicalSkills": 4,
    "communication": 4,
    "leadership": 3,
    "teamwork": 4,
    "problemSolving": 4,
    "goals": "Optimize application performance, contribute to mobile app development, improve testing coverage",
    "achievements": "Improved application load time by 40%, contributed to mobile app beta release, increased test coverage to 85%",
    "areasForImprovement": "Develop leadership skills, participate more in architectural decisions",
    "feedback": "Solid performance with consistent delivery of high-quality work. Good problem-solving skills and reliable team member. Continue developing leadership skills.",
    "reviewerName": "Emily Davis"
  },
  {
    "Id": 3,
    "employeeId": 2,
    "reviewPeriod": "Q3 2024",
    "reviewDate": "2024-09-30",
    "overallRating": 5,
    "technicalSkills": 4,
    "communication": 5,
    "leadership": 5,
    "teamwork": 5,
    "problemSolving": 5,
    "goals": "Launch new product feature, improve team collaboration, establish product roadmap",
    "achievements": "Successfully launched user dashboard feature with 95% user satisfaction, improved team velocity by 25%, created comprehensive product roadmap",
    "areasForImprovement": "Deepen technical knowledge in emerging technologies, improve data analysis skills",
    "feedback": "Outstanding performance as Product Manager. Excellent leadership and communication skills. Successfully managed complex product launches and improved team dynamics.",
    "reviewerName": "Robert Taylor"
  },
  {
    "Id": 4,
    "employeeId": 3,
    "reviewPeriod": "Q3 2024",
    "reviewDate": "2024-09-30",
    "overallRating": 5,
    "technicalSkills": 5,
    "communication": 5,
    "leadership": 5,
    "teamwork": 5,
    "problemSolving": 5,
    "goals": "Scale engineering team, improve development processes, mentor senior developers",
    "achievements": "Hired 3 senior engineers, implemented CI/CD pipeline reducing deployment time by 60%, mentored 5 senior developers",
    "areasForImprovement": "Explore emerging technologies for future architecture, improve cross-department collaboration",
    "feedback": "Exceptional leadership as Engineering Manager. Successfully scaled the team while maintaining high code quality. Excellent mentor and strategic thinker.",
    "reviewerName": "Lisa Anderson"
  },
  {
    "Id": 5,
    "employeeId": 4,
    "reviewPeriod": "Q2 2024",
    "reviewDate": "2024-06-30",
    "overallRating": 4,
    "technicalSkills": 5,
    "communication": 4,
    "leadership": 3,
    "teamwork": 4,
    "problemSolving": 4,
    "goals": "Redesign user interface, improve user experience metrics, collaborate with development team",
    "achievements": "Redesigned 3 major UI components, improved user satisfaction score by 20%, established design system documentation",
    "areasForImprovement": "Improve stakeholder communication, develop presentation skills",
    "feedback": "Strong design skills with excellent attention to detail. Good collaboration with development team. Focus on improving communication with stakeholders.",
    "reviewerName": "Robert Taylor"
  },
  {
    "Id": 6,
    "employeeId": 6,
    "reviewPeriod": "Q3 2024",
    "reviewDate": "2024-09-30",
    "overallRating": 4,
    "technicalSkills": 4,
    "communication": 4,
    "leadership": 3,
    "teamwork": 5,
    "problemSolving": 4,
    "goals": "Develop new microservice, improve code quality, contribute to team knowledge sharing",
    "achievements": "Built payment processing microservice, improved code review standards, led 3 technical presentations",
    "areasForImprovement": "Take on more complex technical challenges, develop system design skills",
    "feedback": "Great team player with strong technical abilities. Excellent collaboration skills and willingness to help others. Ready for more complex technical challenges.",
    "reviewerName": "Emily Davis"
  },
  {
    "Id": 7,
    "employeeId": 9,
    "reviewPeriod": "Q3 2024",
    "reviewDate": "2024-09-30",
    "overallRating": 4,
    "technicalSkills": 5,
    "communication": 4,
    "leadership": 3,
    "teamwork": 4,
    "problemSolving": 5,
    "goals": "Improve test automation coverage, reduce bug detection time, establish QA best practices",
    "achievements": "Increased automation coverage to 90%, reduced bug detection time by 50%, created QA documentation standards",
    "areasForImprovement": "Develop leadership skills, improve cross-team communication",
    "feedback": "Excellent technical skills in QA and testing. Strong problem-solving abilities. Focus on developing leadership and communication skills.",
    "reviewerName": "Emily Davis"
  },
  {
    "Id": 8,
    "employeeId": 10,
    "reviewPeriod": "Q2 2024",
    "reviewDate": "2024-06-30",
    "overallRating": 3,
    "technicalSkills": 3,
    "communication": 4,
    "leadership": 2,
    "teamwork": 4,
    "problemSolving": 3,
    "goals": "Increase sales numbers, improve client relationships, learn new sales techniques",
    "achievements": "Exceeded quarterly sales target by 15%, maintained strong client relationships, completed sales training program",
    "areasForImprovement": "Develop technical product knowledge, improve presentation skills, take initiative in team meetings",
    "feedback": "Good sales performance with strong interpersonal skills. Focus on developing technical knowledge and taking more initiative in leadership opportunities.",
    "reviewerName": "Thomas Jones"
  }
]